Autodesk.Revit.DB.DocumentVersion.IsEqual(Autodesk.Revit.DB.DocumentVersion)
Checks whether two DocumentVersions are identical.
They are identical if both the GUID and number of saves
are equal. If two DocumentVersions are identical, they
come from the same document, with the same set of changes.
other:
The DocumentVersion to compare to this DocumentVersion.
Returns:
True if the two DocumentVersions are equal. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015